{
  "backend/main.mo": "Implements lead submission storage with validation, and an admin‑restricted query to retrieve all leads using access control.",
  "feature_evidence.json": "Lists feature evidence records mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries for major frontend files including pages, components, hooks, and content modules.",
  "frontend/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes using custom color tokens.",
  "frontend/index.html": "HTML entry file setting meta tags, fonts, and mounting the React application root.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and renders the router inside the main App component.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with branding, navigation links, social icons, and dynamic service navigation.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with navigation, logo, and CTAs including WhatsApp expert contact and consultation links.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, footer, and routed content via Outlet.",
  "frontend/src/components/sections/AboutWhyChooseUsSection.tsx": "Renders About and Why Choose Us sections using content and icons, with a CTA button to contact.",
  "frontend/src/components/sections/FaqSection.tsx": "Displays FAQ items in an accordion layout using faqData.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Shows a grid of testimonial cards with star ratings and a button to view more.",
  "frontend/src/content/about.ts": "Exports about page text including description, keywords, and reasons to choose the service.",
  "frontend/src/content/blogPosts.ts": "Defines blog post interface and a list of detailed sample blog posts with headings and body text.",
  "frontend/src/content/faq.ts": "Exports FAQ items containing common tax-related questions and answers.",
  "frontend/src/content/homeContent.ts": "Provides homepage headline, intro text, and CTA bullet points.",
  "frontend/src/content/services.ts": "Defines service interface and detailed service entries with summaries, keywords, and key benefits.",
  "frontend/src/content/testimonials.ts": "Exports a list of client testimonials with name, type, and quote.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor based on user identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for managing Internet Identity authentication using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting leads and fetching all leads via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines light/dark theme color variables for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BlogPage.tsx": "Renders a blog listing page with SEO setup and navigation to individual posts.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post with SEO metadata and related action links.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form that submits leads and offers WhatsApp contact options.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with hero content, CTAs, SEO metadata, and support sections.",
  "frontend/src/pages/PricingPage.tsx": "Renders pricing tiers for tax services with WhatsApp contact actions and sets SEO metadata.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the privacy policy content and sets appropriate page metadata.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows detailed information for a selected service, including benefits and WhatsApp inquiry option.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all services with summaries, key benefits, and navigation to detail pages plus WhatsApp contact.",
  "frontend/src/pages/TermsPage.tsx": "Displays terms and conditions content and sets SEO metadata.",
  "frontend/src/pages/TestimonialsPage.tsx": "Shows client testimonials with ratings and includes a call-to-action to contact the service.",
  "frontend/src/utils/seo.ts": "Sets document title and ensures description and keyword meta tags exist and are updated.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash), persist them in sessionStorage, and retrieve or clear them.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp message URL using a predefined business number and an encoded template message.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Stores the project’s state, goals, requirements, design notes, and existing implemented features."
}